Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAK169.atdf
      <value-group caption="AN36 Mode bit" name="ADCIMCON3__DIFF36">
         <value caption="AN36 is using Differential mode" name="" value="0x1" />
         <value caption="AN36 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN37 Signed Data Mode bit" name="ADCIMCON3__SIGN37">
         <value caption="AN37 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN37 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN37 Mode bit" name="ADCIMCON3__DIFF37">
         <value caption="AN37 is using Differential mode" name="" value="0x1" />
         <value caption="AN37 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN38 Signed Data Mode bit" name="ADCIMCON3__SIGN38">
         <value caption="AN38 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN38 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN38 Mode bit" name="ADCIMCON3__DIFF38">
         <value caption="AN38 is using Differential mode" name="" value="0x1" />
         <value caption="AN38 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN39 Signed Data Mode bit" name="ADCIMCON3__SIGN39">
         <value caption="AN39 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN39 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN39 Mode bit" name="ADCIMCON3__DIFF39">
         <value caption="AN39 is using Differential mode" name="" value="0x1" />
         <value caption="AN39 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN40 Signed Data Mode bit" name="ADCIMCON3__SIGN40">
         <value caption="AN40 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN40 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN40 Mode bit" name="ADCIMCON3__DIFF40">
         <value caption="AN40 is using Differential mode" name="" value="0x1" />
         <value caption="AN40 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN41 Signed Data Mode bit" name="ADCIMCON3__SIGN41">
         <value caption="AN41 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN41 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN41 Mode bit" name="ADCIMCON3__DIFF41">
         <value caption="AN41 is using Differential mode" name="" value="0x1" />
         <value caption="AN41 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN42 Signed Data Mode bit" name="ADCIMCON3__SIGN42">
         <value caption="AN42 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN42 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN42 Mode bit" name="ADCIMCON3__DIFF42">
         <value caption="AN42 is using Differential mode" name="" value="0x1" />
         <value caption="AN42 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN43 Signed Data Mode bit" name="ADCIMCON3__SIGN43">
         <value caption="AN43 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN43 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN43 Mode bit" name="ADCIMCON3__DIFF43">
         <value caption="AN43 is using Differential mode" name="" value="0x1" />
         <value caption="AN43 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN44 Signed Data Mode bit" name="ADCIMCON3__SIGN44">
         <value caption="AN44 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN44 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN44 Mode bit" name="ADCIMCON3__DIFF44">
         <value caption="AN44 is using Differential mode" name="" value="0x1" />
         <value caption="AN44 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 0" name="ADCGIRQEN1__AGIEN0">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 1" name="ADCGIRQEN1__AGIEN1">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 2" name="ADCGIRQEN1__AGIEN2">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 3" name="ADCGIRQEN1__AGIEN3">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 4" name="ADCGIRQEN1__AGIEN4">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 5" name="ADCGIRQEN1__AGIEN5">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
