Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAK169.atdf
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR1__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7" />
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6" />
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5" />
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4" />
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3" />
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2" />
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1" />
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR1__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR1__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR1__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR2__CHNLID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR2__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR2__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR2__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7" />
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6" />
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5" />
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4" />
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3" />
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2" />
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1" />
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR2__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR2__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR2__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR3__CHNLID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR3__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR3__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR3__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7" />
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6" />
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5" />
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4" />
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3" />
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2" />
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1" />
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR3__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1" />
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR3__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1" />
         <value caption="Only the first 12 bits are significant" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR3__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1" />
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR4__CHNLID">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR4__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR4__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR4__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7" />
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6" />
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5" />
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4" />
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3" />
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2" />
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1" />
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0" />
      </value-group>
