Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAK169.atdf
      <value-group caption="Acknowledge Time Status bit" name="I2C1STAT__ACKTIM">
         <value caption="I2C bus is in an Acknowledge sequence" name="" value="0x1" />
         <value caption="Not an Acknowledge sequence" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Status bit" name="I2C1STAT__TRSTAT">
         <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1" />
         <value caption="Master transmit is not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Status bit" name="I2C1STAT__ACKSTAT">
         <value caption="NACK received from slave" name="" value="0x1" />
         <value caption="ACK received from slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C2STAT__TBF">
         <value caption="Transmit in progress" name="" value="0x1" />
         <value caption="Transmit complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C2STAT__RBF">
         <value caption="Receive complete" name="" value="0x1" />
         <value caption="Receive not complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Information bit" name="I2C2STAT__R_W">
         <value caption="Read indicates data transfer is output from slave" name="" value="0x1" />
         <value caption="Write indicates data transfer is input to slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Start bit" name="I2C2STAT__S">
         <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1" />
         <value caption="Start bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop bit" name="I2C2STAT__P">
         <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1" />
         <value caption="Stop bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Data/Address bit" name="I2C2STAT__D_A">
         <value caption="Indicates that the last byte received was data" name="" value="0x1" />
         <value caption="Indicates that the last byte received was device address" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="I2C2STAT__I2COV">
         <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1" />
         <value caption="No overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C2STAT__IWCOL">
         <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="10-bit Address Status bit" name="I2C2STAT__ADD10">
         <value caption="10-bit address was matched" name="" value="0x1" />
         <value caption="10-bit address was not matched" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Status bit" name="I2C2STAT__GCSTAT">
         <value caption="General call address was received" name="" value="0x1" />
         <value caption="General call address was not received" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Bus Collision Detect bit" name="I2C2STAT__BCL">
         <value caption="A bus collision has been detected during a master operation" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Time Status bit" name="I2C2STAT__ACKTIM">
         <value caption="I2C bus is in an Acknowledge sequence" name="" value="0x1" />
         <value caption="Not an Acknowledge sequence" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Status bit" name="I2C2STAT__TRSTAT">
         <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1" />
         <value caption="Master transmit is not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Status bit" name="I2C2STAT__ACKSTAT">
         <value caption="NACK received from slave" name="" value="0x1" />
         <value caption="ACK received from slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C3STAT__TBF">
         <value caption="Transmit in progress" name="" value="0x1" />
         <value caption="Transmit complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C3STAT__RBF">
         <value caption="Receive complete" name="" value="0x1" />
         <value caption="Receive not complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Information bit" name="I2C3STAT__R_W">
         <value caption="Read indicates data transfer is output from slave" name="" value="0x1" />
         <value caption="Write indicates data transfer is input to slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Start bit" name="I2C3STAT__S">
         <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1" />
         <value caption="Start bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop bit" name="I2C3STAT__P">
         <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1" />
         <value caption="Stop bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Data/Address bit" name="I2C3STAT__D_A">
         <value caption="Indicates that the last byte received was data" name="" value="0x1" />
         <value caption="Indicates that the last byte received was device address" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="I2C3STAT__I2COV">
         <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1" />
         <value caption="No overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C3STAT__IWCOL">
         <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
