Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAK169.atdf
         <register caption="" name="IEC3" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCD37IE" />
            <bitfield mask="0x00000002" name="ADCD38IE" />
            <bitfield mask="0x00000004" name="ADCD39IE" />
            <bitfield mask="0x00000008" name="ADCD40IE" />
            <bitfield mask="0x00000010" name="ADCD41IE" />
            <bitfield mask="0x00000020" name="ADCD42IE" />
            <bitfield mask="0x00000040" name="ADCD43IE" />
            <bitfield mask="0x00000100" name="CPCIE" />
            <bitfield mask="0x00000200" name="CFDCIE" />
            <bitfield mask="0x00000400" name="SBIE" />
            <bitfield mask="0x00000800" name="CRPTIE" />
            <bitfield mask="0x00002000" name="SPI1EIE" />
            <bitfield mask="0x00004000" name="SPI1RXIE" />
            <bitfield mask="0x00008000" name="SPI1TXIE" />
            <bitfield mask="0x00010000" name="U1EIE" />
            <bitfield mask="0x00020000" name="U1RXIE" />
            <bitfield mask="0x00040000" name="U1TXIE" />
            <bitfield mask="0x00080000" name="I2C1BIE" />
            <bitfield mask="0x00100000" name="I2C1SIE" />
            <bitfield mask="0x00200000" name="I2C1MIE" />
            <bitfield mask="0x00400000" name="CNAIE" />
            <bitfield mask="0x00800000" name="CNBIE" />
            <bitfield mask="0x01000000" name="CNCIE" />
            <bitfield mask="0x02000000" name="CNDIE" />
            <bitfield mask="0x04000000" name="CNEIE" />
            <bitfield mask="0x08000000" name="CNFIE" />
            <bitfield mask="0x10000000" name="CNGIE" />
            <bitfield mask="0x20000000" name="CNHIE" />
            <bitfield mask="0x40000000" name="CNJIE" />
            <bitfield mask="0x80000000" name="CNKIE" />
         </register>
         <register caption="" name="IEC4" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PMPIE" />
            <bitfield mask="0x00000002" name="PMPEIE" />
            <bitfield mask="0x00000004" name="CMP1IE" />
            <bitfield mask="0x00000008" name="CMP2IE" />
            <bitfield mask="0x00000010" name="USBIE" />
            <bitfield mask="0x00000020" name="USBDMAIE" />
            <bitfield mask="0x00000040" name="DMA0IE" />
            <bitfield mask="0x00000080" name="DMA1IE" />
            <bitfield mask="0x00000100" name="DMA2IE" />
            <bitfield mask="0x00000200" name="DMA3IE" />
            <bitfield mask="0x00000400" name="DMA4IE" />
            <bitfield mask="0x00000800" name="DMA5IE" />
            <bitfield mask="0x00001000" name="DMA6IE" />
            <bitfield mask="0x00002000" name="DMA7IE" />
            <bitfield mask="0x00004000" name="SPI2EIE" />
            <bitfield mask="0x00008000" name="SPI2RXIE" />
            <bitfield mask="0x00010000" name="SPI2TXIE" />
            <bitfield mask="0x00020000" name="U2EIE" />
            <bitfield mask="0x00040000" name="U2RXIE" />
            <bitfield mask="0x00080000" name="U2TXIE" />
            <bitfield mask="0x00100000" name="I2C2BIE" />
            <bitfield mask="0x00200000" name="I2C2SIE" />
            <bitfield mask="0x00400000" name="I2C2MIE" />
            <bitfield mask="0x00800000" name="CAN1IE" />
            <bitfield mask="0x01000000" name="CAN2IE" />
            <bitfield mask="0x02000000" name="ETHIE" />
            <bitfield mask="0x04000000" name="SPI3EIE" />
            <bitfield mask="0x08000000" name="SPI3RXIE" />
            <bitfield mask="0x10000000" name="SPI3TXIE" />
            <bitfield mask="0x20000000" name="U3EIE" />
            <bitfield mask="0x40000000" name="U3RXIE" />
            <bitfield mask="0x80000000" name="U3TXIE" />
         </register>
         <register caption="" name="IEC5" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="I2C3BIE" />
            <bitfield mask="0x00000002" name="I2C3SIE" />
            <bitfield mask="0x00000004" name="I2C3MIE" />
            <bitfield mask="0x00000008" name="SPI4EIE" />
            <bitfield mask="0x00000010" name="SPI4RXIE" />
            <bitfield mask="0x00000020" name="SPI4TXIE" />
            <bitfield mask="0x00000040" name="RTCCIE" />
            <bitfield mask="0x00000080" name="FCEIE" />
            <bitfield mask="0x00000100" name="PREIE" />
            <bitfield mask="0x00000200" name="SQI1IE" />
            <bitfield mask="0x00000400" name="U4EIE" />
            <bitfield mask="0x00000800" name="U4RXIE" />
            <bitfield mask="0x00001000" name="U4TXIE" />
            <bitfield mask="0x00002000" name="I2C4BIE" />
            <bitfield mask="0x00004000" name="I2C4SIE" />
            <bitfield mask="0x00008000" name="I2C4MIE" />
            <bitfield mask="0x00010000" name="SPI5EIE" />
            <bitfield mask="0x00020000" name="SPI5RXIE" />
            <bitfield mask="0x00040000" name="SPI5TXIE" />
            <bitfield mask="0x00080000" name="U5EIE" />
            <bitfield mask="0x00100000" name="U5RXIE" />
            <bitfield mask="0x00200000" name="U5TXIE" />
            <bitfield mask="0x00400000" name="I2C5BIE" />
            <bitfield mask="0x00800000" name="I2C5SIE" />
            <bitfield mask="0x01000000" name="I2C5MIE" />
            <bitfield mask="0x02000000" name="SPI6IE" />
            <bitfield mask="0x04000000" name="SPI6RXIE" />
            <bitfield mask="0x08000000" name="SPI6TXIE" />
            <bitfield mask="0x10000000" name="U6EIE" />
            <bitfield mask="0x20000000" name="U6RXIE" />
            <bitfield mask="0x40000000" name="U6TXIE" />
            <bitfield mask="0x80000000" name="SDHCIE" />
         </register>
         <register caption="" name="IEC6" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="GLCDIE" />
            <bitfield mask="0x00000002" name="GPUIE" />
            <bitfield mask="0x00000008" name="CTMUIE" />
            <bitfield mask="0x00000010" name="ADCEOSIE" />
            <bitfield mask="0x00000020" name="ADCARDYIE" />
            <bitfield mask="0x00000040" name="ADCURDYIE" />
            <bitfield mask="0x00000080" name="ADC0EIE" />
            <bitfield mask="0x00000100" name="ADC1EIE" />
            <bitfield mask="0x00000200" name="ADC2EIE" />
            <bitfield mask="0x00000400" name="ADC3EIE" />
            <bitfield mask="0x00000800" name="ADC4EIE" />
            <bitfield mask="0x00002000" name="ADCGRPIE" />
            <bitfield mask="0x00004000" name="ADC7EIE" />
            <bitfield mask="0x00008000" name="ADC0WIE" />
            <bitfield mask="0x00010000" name="ADC1WIE" />
            <bitfield mask="0x00020000" name="ADC2WIE" />
            <bitfield mask="0x00040000" name="ADC3WIE" />
            <bitfield mask="0x00080000" name="ADC4WIE" />
            <bitfield mask="0x00400000" name="ADC7WIE" />
            <bitfield mask="0x00800000" name="MPLLFLTIE" />
         </register>
         <register caption="" name="IPC0" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS" />
            <bitfield mask="0x0000001C" name="CTIP" />
            <bitfield mask="0x00000300" name="CS0IS" />
            <bitfield mask="0x00001C00" name="CS0IP" />
            <bitfield mask="0x00030000" name="CS1IS" />
            <bitfield mask="0x001C0000" name="CS1IP" />
            <bitfield mask="0x03000000" name="INT0IS" />
            <bitfield mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="" name="IPC1" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS" />
            <bitfield mask="0x0000001C" name="T1IP" />
            <bitfield mask="0x00000300" name="IC1EIS" />
            <bitfield mask="0x00001C00" name="IC1EIP" />
            <bitfield mask="0x00030000" name="IC1IS" />
            <bitfield mask="0x001C0000" name="IC1IP" />
            <bitfield mask="0x03000000" name="OC1IS" />
            <bitfield mask="0x1C000000" name="OC1IP" />
         </register>
         <register caption="" name="IPC2" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000003" name="INT1IS" />
            <bitfield mask="0x0000001C" name="INT1IP" />
            <bitfield mask="0x00000300" name="T2IS" />
            <bitfield mask="0x00001C00" name="T2IP" />
            <bitfield mask="0x00030000" name="IC2EIS" />
            <bitfield mask="0x001C0000" name="IC2EIP" />
            <bitfield mask="0x03000000" name="IC2IS" />
            <bitfield mask="0x1C000000" name="IC2IP" />
         </register>
         <register caption="" name="IPC3" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00000003" name="OC2IS" />
            <bitfield mask="0x0000001C" name="OC2IP" />
            <bitfield mask="0x00000300" name="INT2IS" />
            <bitfield mask="0x00001C00" name="INT2IP" />
            <bitfield mask="0x00030000" name="T3IS" />
            <bitfield mask="0x001C0000" name="T3IP" />
            <bitfield mask="0x03000000" name="IC3EIS" />
            <bitfield mask="0x1C000000" name="IC3EIP" />
         </register>
         <register caption="" name="IPC4" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC3IS" />
            <bitfield mask="0x0000001C" name="IC3IP" />
            <bitfield mask="0x00000300" name="OC3IS" />
            <bitfield mask="0x00001C00" name="OC3IP" />
            <bitfield mask="0x00030000" name="INT3IS" />
            <bitfield mask="0x001C0000" name="INT3IP" />
            <bitfield mask="0x03000000" name="T4IS" />
            <bitfield mask="0x1C000000" name="T4IP" />
         </register>
